nxp-mcuxpresso/mcux-soc-svd/MCXA566/MCXA566.xml
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SmartDMA_TRIG[%s]</name>
          <description>SmartDMA Trigger Input Connections</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input number for SmartDMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>GPIO P0_16 input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>GPIO P0_17 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>GPIO P1_8 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>GPIO P1_9 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>GPIO P1_10 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>GPIO P1_11 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>GPIO P1_12 input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>GPIO P1_13 input is selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>GPIO P2_0 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>GPIO P2_1 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>GPIO P2_2 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>GPIO P2_3 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>GPIO P2_6 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>GPIO P3_8 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>GPIO P3_9 input is selected</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>GPIO P3_10 input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>GPIO P3_11 input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>GPIO P3_12 input is seclected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>GPIO0 Pin Event Trig input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>GPIO1 Pin Event Trig input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>GPIO2 Pin Event Trig input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>GPIO3 Pin Event Trig input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>GPIO4 Pin Event Trig input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>ARM_TXEV input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>AOI0_OUT0 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>DMA_IRQ input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>WUU_IRQ input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>CTimer0_MAT3 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>CTimer2_MAT2 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>CTimer2_MAT3 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>CTimer3_MAT2 input is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>CTimer3_MAT3 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>CTimer4_MAT2 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>CTimer4_MAT3 input is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>OSTIMER_IRQ input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>RTC_Alarm_IRQ input is selected</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>uTICK_IRQ input is selected</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>WDT_IRQ input is selected</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>Wakeup_Timer_IRQ input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>CAN0_IRQ input is selected</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>CAN1_IRQ input is selected</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>FlexIO0_IRQ input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>FlexIO0_Shifer0_DMA_Req input is selected</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val54</name>
                  <description>FlexIO0_Shifer1_DMA_Req input is selected</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val55</name>
                  <description>FlexIO0_Shifer2_DMA_Req input is selected</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val56</name>
                  <description>FlexIO0_Shifer3_DMA_Req input is selected</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val57</name>
                  <description>I3C0_IRQ input is selected</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val58</name>
                  <description>LPI2C0_IRQ input is selected</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val59</name>
                  <description>LPI2C1_IRQ input is selected</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val60</name>
                  <description>LPSPI0_IRQ input is selected</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val61</name>
                  <description>LPSPI1_IRQ input is selected</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>LPUART0_IRQ input is selected</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val63</name>
                  <description>LPUART1_IRQ input is selected</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val64</name>
                  <description>LPUART2_IRQ input is selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>LPUART3_IRQ input is selected</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>USB1 Start of Frame input is selected</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val68</name>
                  <description>ADC0_IRQ input is selected</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val69</name>
                  <description>ADC1_IRQ input is selected</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val72</name>
                  <description>CMP0_IRQ input is selected</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val75</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val78</name>
                  <description>DAC0_IRQ input is selected</description>
                  <value>0x4E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val80</name>
                  <description>DMA1_IRQ input is selected</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val81</name>
                  <description>DAC1_IRQ input is selected</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val82</name>
                  <description>TSI0_End_of_Scan_IRQ input is selected</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val83</name>
                  <description>TSI0_Out_of_Range_IRQ input is selected</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val84</name>
                  <description>ENET QOS IRQ input is selected</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val85</name>
                  <description>10BASE_T1S IRQ input is selected</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val86</name>
                  <description>ERM Interrupt input is selected</description>
                  <value>0x56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val87</name>
                  <description>TMPR_OUT0 input is selected</description>
                  <value>0x57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val88</name>
                  <description>TMPR_OUT1 input is selected</description>
                  <value>0x58</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
