nxp-mcuxpresso/mcux-soc-svd/MCXA566/MCXA566.xml
        <register>
          <name>PLCARECST</name>
          <description>PLCA Status</description>
          <addressOffset>0xCC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RECST</name>
              <description>Recovering Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECTRL</name>
          <description>MODE Control</description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CMD</name>
              <description>Set back to NONE when mode controller has entered the selected mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Linkdown</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LI</name>
                  <description>Linkup</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>TXCCFG</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low-power</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCBIST</name>
                  <description>TXCBIST</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECFG</name>
          <description>Mode Configuration</description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LCLWKENA</name>
              <description>Enable wake-up to WAITINIT mode by local-wake-event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSDIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSEN</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REMWKENA</name>
              <description>Enable wake-up to WAITINIT mode by remote-wake-event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSDIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSEN</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSPWKENA</name>
              <description>Enable wake-up to WAITINIT mode by SUSPEND detection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSDIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSEN</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODESTAT</name>
          <description>Mode Status</description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>STAT</name>
              <description>Status power-mode sequencer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORST</name>
                  <description>PORST</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>WAITINIT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linkdown</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINKUP</name>
                  <description>Linkup</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITCM</name>
                  <description>WAITCMDLP</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low-power</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAI</name>
                  <description>WAITCMDCFG</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXC</name>
                  <description>TXCCFG</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCB</name>
                  <description>TXCBIST</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITS</name>
                  <description>WAITSSILENTLP</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITSI</name>
                  <description>WAITSILENTCFG</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SILENTTO</name>
              <description>Silent Time-out condition</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSDIS</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSEN</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WKCTRL</name>
          <description>Wake Control</description>
          <addressOffset>0x120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>REMWKFDW</name>
              <description>Command to generate a wake-forward pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REM_NO</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REM_YES</name>
                  <description>Trigger generation of a wake-forward pulse</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WKCFG</name>
          <description>Wake Configuration</description>
          <addressOffset>0x122</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>REMKWKFDW</name>
              <description>Enable wake forwarding of a remote-wake-event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REM_NO</name>
                  <description>DISABLED</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REM_YES</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WUPCTRL</name>
          <description>Wake Control</description>
          <addressOffset>0x126</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WUPCMD</name>
              <description>Trigger the WUP sequencer transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WUP_N</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUP_TRIG</name>
                  <description>Trigger WUP-sequencer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABORTCMD</name>
              <description>Abort the WUP sequencer when pending.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REM_N</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REM_TRIG</name>
                  <description>Abort WUP-sequencer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WUPCFG</name>
          <description>Wakeup Configuration</description>
          <addressOffset>0x128</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFF01</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LCLWKWUP</name>
              <description>Enable WUP transmission by local-wake-event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WUPT_DIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUPT_EN</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPTIMEOUT</name>
              <description>Wakeup Timeout</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WUPSTAT</name>
          <description>Wakeup Status</description>
          <addressOffset>0x12A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>STAT</name>
              <description>Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD_2</name>
                  <description>WAITLINK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STPEND</name>
                  <description>PENDING</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSMIT</name>
                  <description>TRANSMIT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRCODE</name>
              <description>Error code</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>NONE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWABORT</name>
                  <description>SWABORT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODECHG</name>
                  <description>MODECHG</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOWM</name>
                  <description>TOWM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOPD</name>
                  <description>TOPD</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOWP</name>
                  <description>TOWP</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOWA</name>
                  <description>TOWA</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE</name>
                  <description>CORE</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMIDATA</name>
          <description>SMI Frame DATA</description>
          <addressOffset>0x140</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Frame Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMICTRL</name>
          <description>SMI Control</description>
          <addressOffset>0x142</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4082</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TA</name>
              <description>Turn Around</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RA</name>
              <description>Register Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA</name>
              <description>PHY Address</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP</name>
              <description>Operation</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_COMPERR</name>
                  <description>WRITE_COMPERR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>WRITE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>READ</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_COMPERR</name>
                  <description>READ_COMPERR</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ST</name>
              <description>Start</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMICFG</name>
          <description>SMI Configuration</description>
          <addressOffset>0x144</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SPEED</name>
              <description>Speed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPRE</name>
              <description>Disable SMI Preamble</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISPRE_HOLD_1</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISPRE_HOLD_2</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOLD</name>
              <description>Hold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOLD_1</name>
                  <description>HOLD_1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD_2</name>
                  <description>HOLD_2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD_3</name>
                  <description>HOLD_3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD_4</name>
                  <description>HOLD_4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD_5</name>
                  <description>HOLD_5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD_6</name>
                  <description>6 PCLK cycles 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD_7</name>
                  <description>HOLD_7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD_8</name>
                  <description>HOLD_8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
