nxp-mcuxpresso/mcux-soc-svd/MCXA566/MCXA566.xml
        <register>
          <name>INTSTAT2</name>
          <description>Interrupt Status2</description>
          <addressOffset>0x176</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PHYSCOL</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCAREC</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCASTAT</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODESTAT</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVLDAPB</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCJAB</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REMJAB</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINFAULT</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCADIAG</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMIACCESS</name>
              <description>status of corresponding interrupt after enable stage</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCLWK</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSPDET</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUTDET</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDONE</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APBPARITY</name>
              <description>Status of corresponding interrupt after enable stage</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NP</name>
                  <description>Not Pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCADIAG1</name>
          <description>PLCA TC14 Adv diagnostics</description>
          <addressOffset>0x1A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BCNBFTO</name>
              <description>Beacon Consecutive</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO3</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes3</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNEXPB</name>
              <description>Unexpected Beacon</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO4</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes4</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXINTO</name>
              <description>Indicates Reception</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCADIAG2</name>
          <description>PLCA NXP prop diagnostics</description>
          <addressOffset>0x1A2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>EARLYBCN</name>
              <description>Early Beacon</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO8</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes8</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LATEBCN</name>
              <description>Late Beacon</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO7</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes7</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NORXBCN</name>
              <description>No Beacon Received</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO6</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes6</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNDEFSTATE</name>
              <description>Undefined State</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO5</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes5</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCADIAG3</name>
          <description>PLCA Beacon Counter Diagnostics</description>
          <addressOffset>0x1A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RXBCNTCNT</name>
              <description>RX Beacon Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCADIAG4</name>
          <description>PLCA TO Counter Diagnostics</description>
          <addressOffset>0x1A6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TOCNT</name>
              <description>Transmit Opportunity Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCDIAG</name>
          <description>Transceiver Diagnostics</description>
          <addressOffset>0x1A8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RXLOWFAIL</name>
              <description>RX Low Pin Detect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO12</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes12</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXHGHFAIL</name>
              <description>RX High Pin Detect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO11</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes11</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDLOWFAIL</name>
              <description>Stuck Low ED Pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO8</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes8</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDHGHFAIL</name>
              <description>Stuck High ED Pin</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO11</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes11</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPWRFAIL</name>
              <description>Low Power Failure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO10</name>
                  <description>NO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes10</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
