nxp-mcuxpresso/mcux-soc-svd/MCXA566/MCXA566.xml
        <register>
          <name>PCNS</name>
          <description>Pin Control Nonsecure</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSE0</name>
              <description>Nonsecure Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE1</name>
              <description>Nonsecure Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE2</name>
              <description>Nonsecure Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE3</name>
              <description>Nonsecure Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE4</name>
              <description>Nonsecure Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE5</name>
              <description>Nonsecure Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE6</name>
              <description>Nonsecure Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE7</name>
              <description>Nonsecure Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE8</name>
              <description>Nonsecure Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE9</name>
              <description>Nonsecure Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE10</name>
              <description>Nonsecure Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE11</name>
              <description>Nonsecure Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE12</name>
              <description>Nonsecure Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE13</name>
              <description>Nonsecure Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE14</name>
              <description>Nonsecure Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE15</name>
              <description>Nonsecure Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE16</name>
              <description>Nonsecure Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE17</name>
              <description>Nonsecure Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE18</name>
              <description>Nonsecure Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE19</name>
              <description>Nonsecure Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE20</name>
              <description>Nonsecure Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE21</name>
              <description>Nonsecure Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE22</name>
              <description>Nonsecure Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE23</name>
              <description>Nonsecure Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE24</name>
              <description>Nonsecure Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE25</name>
              <description>Nonsecure Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE26</name>
              <description>Nonsecure Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE27</name>
              <description>Nonsecure Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE28</name>
              <description>Nonsecure Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE29</name>
              <description>Nonsecure Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE30</name>
              <description>Nonsecure Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE31</name>
              <description>Nonsecure Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
