nxp-mcuxpresso/mcux-soc-svd/MCXA566/MCXA566.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WUU0</name>
      <description>Low-Leakage Wakeup Unit</description>
      <groupName>WUU</groupName>
      <baseAddress>0x40092000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WUU0</name>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard features implemented</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILT_ALL_PWR</name>
                  <description>Support for DMA/Trigger generation from wake-up pins and filters enabled. Support for external pin/filter detection during all power modes enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20202002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILTERS</name>
              <description>Filter Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAS</name>
              <description>DMA Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODULES</name>
              <description>Module Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PINS</name>
              <description>Pin Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE1</name>
          <description>Pin Enable 1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUPE0</name>
              <description>Wake-up Pin Enable for LLWU_P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE1</name>
              <description>Wake-up Pin Enable for LLWU_P1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE2</name>
              <description>Wake-up Pin Enable for LLWU_P2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE3</name>
              <description>Wake-up Pin Enable for LLWU_P3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE4</name>
              <description>Wake-up Pin Enable for LLWU_P4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE5</name>
              <description>Wake-up Pin Enable for LLWU_P5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE6</name>
              <description>Wake-up Pin Enable for LLWU_P6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE7</name>
              <description>Wake-up Pin Enable for LLWU_P7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE8</name>
              <description>Wake-up Pin Enable for LLWU_P8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE9</name>
              <description>Wake-up Pin Enable for LLWU_P9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE10</name>
              <description>Wake-up Pin Enable for LLWU_P10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE11</name>
              <description>Wake-up Pin Enable for LLWU_P11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE12</name>
              <description>Wake-up Pin Enable for LLWU_P12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE13</name>
              <description>Wake-up Pin Enable for LLWU_P13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE14</name>
              <description>Wake-up Pin Enable for LLWU_P14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE15</name>
              <description>Wake-up Pin Enable for LLWU_P15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
