nxp-mcuxpresso/mcux-soc-svd/MCXA566/MCXA566.xml
        <register>
          <name>IFLAG1</name>
          <description>Interrupt Flags 1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>BUF0I</name>
              <description>Buffer MB0 Interrupt or Clear Legacy FIFO bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>buffer_Tx_Rx_not_complete</name>
                  <description>MB0 has no occurrence of successfully completed transmission or reception.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>buffer_Tx_Rx_complete</name>
                  <description>MB0 has successfully completed transmission or reception.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF4TO1I</name>
              <description>Buffer MBi Interrupt or Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BUF5I</name>
              <description>Buffer MB5 Interrupt or Frames available in Legacy RX FIFO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id1</name>
                  <description>No occurrence of completed transmission or reception, or no frames available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id2</name>
                  <description>MB5 completed transmission or reception, or frames available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF6I</name>
              <description>Buffer MB6 Interrupt or Legacy RX FIFO Warning</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id1</name>
                  <description>No occurrence of MB6 completing transmission or reception, or FIFO not almost full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id2</name>
                  <description>MB6 completed transmission or reception, or FIFO almost full.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF7I</name>
              <description>Buffer MB7 Interrupt or Legacy RX FIFO Overflow</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id1</name>
                  <description>No occurrence of MB7 completing transmission or reception, or no FIFO overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id2</name>
                  <description>MB7 completed transmission or reception, or FIFO overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF31TO8I</name>
              <description>Buffer MBi Interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <description>Control 2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0001C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RETRY</name>
              <description>Number of Retransmission Requests</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>retransmission</name>
                  <description>No retransmission</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Count_retry</name>
                  <description>Count of re-transmission attempts</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Count_retry1</name>
                  <description>Count of re-transmission attempts</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Count_retry2</name>
                  <description>Count of re-transmission attempts</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Count_retry3</name>
                  <description>Count of re-transmission attempts</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Count_retry4</name>
                  <description>Count of re-transmission attempts</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Count_retry5</name>
                  <description>Count of re-transmission attempts</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>unlimit_retry</name>
                  <description>Unlimited number of retransmission</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT_RXN</name>
              <description>Fault reaction</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Fault reaction is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Fault reaction is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDFLTDIS</name>
              <description>Edge Filter Disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISOCANFDEN</name>
              <description>ISO CAN FD Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>non_ISO</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTE</name>
              <description>Bit Timing Expansion Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREXCEN</name>
              <description>Protocol Exception Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EACEN</name>
              <description>Entire Frame Arbitration Field Comparison Enable for RX Message Buffers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTR_compare_no</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTR_compare_yes</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRS</name>
              <description>Remote Request Storing</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>remote_response_frame_not_generated</name>
                  <description>Generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>remote_response_frame_generated</name>
                  <description>Stored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRP</name>
              <description>Message Buffers Reception Priority</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Matching starts from Legacy RX FIFO or Enhanced RX FIFO and continues on message buffers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id3</name>
                  <description>Matching starts from message buffers and continues on Legacy RX FIFO or Enhanced RX FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TASD</name>
              <description>Transmission Arbitration Start Delay</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFFN</name>
              <description>Number of Legacy Receive FIFO Filters</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOFFDONEMSK</name>
              <description>Bus Off Done Interrupt Mask</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRMSK_FAST</name>
              <description>Error Interrupt Mask for Errors Detected in the Data Phase of Fast CAN FD Frames</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ESR2</name>
          <description>Error and Status 2</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_PIN_ST</name>
              <description>RX Pin Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Dominant</name>
                  <description>RX pin is in the dominant state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Recessive</name>
                  <description>RX pin is in a recessive state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMB</name>
              <description>Inactive Message Buffer</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive_mailbox_no</name>
                  <description>Message buffer indicated by ESR2[LPTM] is not inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inactive_mailbox_yes</name>
                  <description>At least one message buffer is inactive.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VPS</name>
              <description>Valid Priority Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>invalid</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTM</name>
              <description>Lowest Priority TX Message Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCR</name>
          <description>Cyclic Redundancy Check</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXCRC</name>
              <description>Transmitted CRC value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MBCRC</name>
              <description>CRC Message Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFGMASK</name>
          <description>Legacy RX FIFO Global Mask</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>FGM</name>
              <description>Legacy RX FIFO Global Mask Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIR</name>
          <description>Legacy RX FIFO Information</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>IDHIT</name>
              <description>Identifier Acceptance Filter Hit Indicator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBT</name>
          <description>CAN Bit Timing</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EPSEG2</name>
              <description>Extended Phase Segment 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPSEG1</name>
              <description>Extended Phase Segment 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPROPSEG</name>
              <description>Extended Propagation Segment</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERJW</name>
              <description>Extended Resync Jump Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPRESDIV</name>
              <description>Extended Prescaler Division Factor</description>
              <bitOffset>21</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTF</name>
              <description>Bit Timing Format Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ET</name>
          <description>External Timer</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMER</name>
              <description>Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
